## Terraform plan (envs/dev)\n\n<details>\n<summary>Plan summary</summary>\n\n```text\ncreate:  17\nupdate:  0\ndelete:  0\nreplace: 0\nread:    3\nno_op:   0\n```\n</details>\n\n<details>\n<summary>Full plan (expand)</summary>\n\n```text\n
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks[0].data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks[0].aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-30"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-coredns"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-30"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-kube-proxy"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "goldenpath-dev-eks-26-12-29-30"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "eu-west-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                    = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-vpc-cni"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
    }

  # module.eks[0].aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "goldenpath-dev-eks-26-12-29-30"
      + platform_version              = (known after apply)
      + region                        = "eu-west-2"
      + role_arn                      = "arn:aws:iam::593517239005:role/goldenpath-dev-eks-26-12-29-30-cluster-role"
      + status                        = (known after apply)
      + tags                          = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all                      = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-002bd0b4ce04c286c",
            ]
          + subnet_ids                = [
              + "subnet-03f223814c868914c",
              + "subnet-0c18c6818b60e4a4c",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks[0].aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "goldenpath-dev-eks-26-12-29-30"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::593517239005:role/goldenpath-dev-eks-26-12-29-30-node-role"
      + region                 = "eu-west-2"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03f223814c868914c",
          + "subnet-0c18c6818b60e4a4c",
        ]
      + tags                   = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all               = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 4
          + max_size     = 7
          + min_size     = 4
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks[0].aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all        = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-eks-26-12-29-30-oidc-provider"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-cluster-autoscaler-26-12-29-30"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-cluster-role-26-12-29-30"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.eks_node_group will be created
  + resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-dev-eks-node-role-26-12-29-30"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldenpath-idp-aws-load-balancer-controller-26-12-29-30"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all              = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam[0].aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/golden-path-cluster-autoscaler-policy"
      + role       = "goldenpath-idp-cluster-autoscaler-26-12-29-30"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "goldenpath-dev-eks-cluster-role-26-12-29-30"
    }

  # module.iam[0].aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "goldenpath-dev-eks-cluster-role-26-12-29-30"
    }

  # module.iam[0].aws_iam_role_policy_attachment.lb_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::593517239005:policy/goldenpath-load-balancer-controller-policy"
      + role       = "goldenpath-idp-aws-load-balancer-controller-26-12-29-30"
    }

  # module.private_route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = "nat-0794a55ca7edea70a"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-30-private-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + tags_all         = {
          + "BuildId"     = "26-12-29-30"
          + "Environment" = "dev"
          + "Lifecycle"   = "ephemeral"
          + "ManagedBy"   = "terraform"
          + "Name"        = "goldenpath-dev-26-12-29-30-private-rt"
          + "Owner"       = "platform-team"
          + "Project"     = "goldenpath-idp"
        }
      + vpc_id           = "vpc-0218ee645c766a250"
    }

  # module.private_route_table.aws_route_table_association.this["0"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03f223814c868914c"
    }

  # module.private_route_table.aws_route_table_association.this["1"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0c18c6818b60e4a4c"
    }

Plan: 17 to add, 0 to change, 0 to destroy.
\n```\n</details>\n\n_Truncated to 65k characters if needed._